Get deformed shape settings object from the style.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public AnalysisDisplayDeformedShapeSettings GetDeformedShapeSettings()
  Visual Basic
Public Function GetDeformedShapeSettings As AnalysisDisplayDeformedShapeSettings
  Visual C++
public:
AnalysisDisplayDeformedShapeSettings^ GetDeformedShapeSettings()
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions InvalidOperationException   |   deformed shape settings were not created with the object.
 See Also
  AnalysisDisplayStyle Class
  Autodesk.Revit.DB.Analysis Namespace